Tekla Open API Reference for Tekla Structures 2025
CannotModifyNonActiveDrawingException Class
 The CannotModifyNonActiveDrawingException class defines the exception that is thrown when a user tries to modify a drawing that is not set as active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotModifyNonActiveDrawingException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotModifyNonActiveDrawingException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotModifyNonActiveDrawingException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotModifyNonActiveDrawingException type exposes the following members.
Constructors
Name | Description
CannotModifyNonActiveDrawingException
 Creates a new cannot modify non-active drawing exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace